class QuranResource{

  static const List<String> quranSurahs = [
    "الفاتحة",
    "البقرة",
    "آل عمران",
    "النساء",
    "المائدة",
    "الأنعام",
    "الأعراف",
    "الأنفال",
    "التوبة",
    "يونس",
    "هود",
    "يوسف",
    "الرعد",
    "إبراهيم",
    "الحجر",
    "النحل",
    "الإسراء",
    "الكهف",
    "مريم",
    "طه",
    "الأنبياء",
    "الحج",
    "المؤمنون",
    "النور",
    "الفرقان",
    "الشعراء",
    "النمل",
    "القصص",
    "العنكبوت",
    "الروم",
    "لقمان",
    "السجدة",
    "الأحزاب",
    "سبأ",
    "فاطر",
    "يس",
    "الصافات",
    "ص",
    "الزمر",
    "غافر",
    "فصلت",
    "الشورى",
    "الزخرف",
    "الدخان",
    "الجاثية",
    "الأحقاف",
    "محمد",
    "الفتح",
    "الحجرات",
    "ق",
    "الذاريات",
    "الطور",
    "النجم",
    "القمر",
    "الرحمن",
    "الواقعة",
    "الحديد",
    "المجادلة",
    "الحشر",
    "الممتحنة",
    "الصف",
    "الجمعة",
    "المنافقون",
    "التغابن",
    "الطلاق",
    "التحريم",
    "الملك",
    "القلم",
    "الحاقة",
    "المعارج",
    "نوح",
    "الجن",
    "المزمل",
    "المدثر",
    "القيامة",
    "الإنسان",
    "المرسلات",
    "النبأ",
    "النازعات",
    "عبس",
    "التكوير",
    "الانفطار",
    "المطففين",
    "الانشقاق",
    "البروج",
    "الطارق",
    "الأعلى",
    "الغاشية",
    "الفجر",
    "البلد",
    "الشمس",
    "الليل",
    "الضحى",
    "الشرح",
    "التين",
    "العلق",
    "القدر",
    "البينة",
    "الزلزلة",
    "العاديات",
    "القارعة",
    "التكاثر",
    "العصر",
    "الهمزة",
    "الفيل",
    "قريش",
    "الماعون",
    "الكوثر",
    "الكافرون",
    "النصر",
    "المسد",
    "الإخلاص",
    "الفلق",
    "الناس",
  ];
  static const List<String> quranSurahsEnglish = [
    "Al-Fatiha",
    "Al-Baqarah",
    "Aal-E-Imran",
    "An-Nisa",
    "Al-Maidah",
    "Al-An'am",
    "Al-A'raf",
    "Al-Anfal",
    "At-Tawbah",
    "Yunus",
    "Hud",
    "Yusuf",
    "Ar-Ra'd",
    "Ibrahim",
    "Al-Hijr",
    "An-Nahl",
    "Al-Isra",
    "Al-Kahf",
    "Maryam",
    "Ta-Ha",
    "Al-Anbiya",
    "Al-Hajj",
    "Al-Mu'minun",
    "An-Nur",
    "Al-Furqan",
    "Ash-Shu'ara",
    "An-Naml",
    "Al-Qasas",
    "Al-Ankabut",
    "Ar-Rum",
    "Luqman",
    "As-Sajda",
    "Al-Ahzab",
    "Saba",
    "Fatir",
    "Ya-Sin",
    "As-Saffat",
    "Sad",
    "Az-Zumar",
    "Ghafir",
    "Fussilat",
    "Ash-Shura",
    "Az-Zukhruf",
    "Ad-Dukhan",
    "Al-Jathiya",
    "Al-Ahqaf",
    "Muhammad",
    "Al-Fath",
    "Al-Hujurat",
    "Qaf",
    "Adh-Dhariyat",
    "At-Tur",
    "An-Najm",
    "Al-Qamar",
    "Ar-Rahman",
    "Al-Waqia",
    "Al-Hadid",
    "Al-Mujadila",
    "Al-Hashr",
    "Al-Mumtahina",
    "As-Saff",
    "Al-Jumua",
    "Al-Munafiqun",
    "At-Taghabun",
    "At-Talaq",
    "At-Tahrim",
    "Al-Mulk",
    "Al-Qalam",
    "Al-Haqqa",
    "Al-Ma'arij",
    "Nuh",
    "Al-Jinn",
    "Al-Muzzammil",
    "Al-Muddathir",
    "Al-Qiyama",
    "Al-Insan",
    "Al-Mursalat",
    "An-Naba",
    "An-Nazi'at",
    "Abasa",
    "At-Takwir",
    "Al-Infitar",
    "Al-Mutaffifin",
    "Al-Inshiqaq",
    "Al-Buruj",
    "At-Tariq",
    "Al-A'la",
    "Al-Ghashiya",
    "Al-Fajr",
    "Al-Balad",
    "Ash-Shams",
    "Al-Lail",
    "Ad-Duha",
    "Ash-Sharh",
    "At-Tin",
    "Al-Alaq",
    "Al-Qadr",
    "Al-Bayyina",
    "Az-Zalzala",
    "Al-Adiyat",
    "Al-Qari'a",
    "At-Takathur",
    "Al-Asr",
    "Al-Humaza",
    "Al-Fil",
    "Quraish",
    "Al-Ma'un",
    "Al-Kawthar",
    "Al-Kafiroon",
    "An-Nasr",
    "Al-Masad",
    "Al-Ikhlas",
    "Al-Falaq",
    "An-Nas",
  ];
  static const List<int> quranSurahVerses = [
    7,    // الفاتحة
    286,  // البقرة
    200,  // آل عمران
    176,  // النساء
    120,  // المائدة
    165,  // الأنعام
    206,  // الأعراف
    75,   // الأنفال
    129,  // التوبة
    109,  // يونس
    123,  // هود
    111,  // يوسف
    43,   // الرعد
    52,   // إبراهيم
    99,   // الحجر
    128,  // النحل
    111,  // الإسراء
    110,  // الكهف
    98,   // مريم
    135,  // طه
    112,  // الأنبياء
    78,   // الحج
    118,  // المؤمنون
    64,   // النور
    77,   // الفرقان
    227,  // الشعراء
    93,   // النمل
    88,   // القصص
    69,   // العنكبوت
    60,   // الروم
    34,   // لقمان
    30,   // السجدة
    73,   // الأحزاب
    54,   // سبأ
    45,   // فاطر
    83,   // يس
    182,  // الصافات
    88,   // ص
    75,   // الزمر
    85,   // غافر
    54,   // فصلت
    53,   // الشورى
    89,   // الزخرف
    59,   // الدخان
    37,   // الجاثية
    35,   // الأحقاف
    38,   // محمد
    29,   // الفتح
    18,   // الحجرات
    45,   // ق
    60,   // الذاريات
    49,   // الطور
    62,   // النجم
    55,   // القمر
    78,   // الرحمن
    96,   // الواقعة
    29,   // الحديد
    22,   // المجادلة
    24,   // الحشر
    13,   // الممتحنة
    14,   // الصف
    11,   // الجمعة
    11,   // المنافقون
    18,   // التغابن
    12,   // الطلاق
    12,   // التحريم
    30,   // الملك
    52,   // القلم
    52,   // الحاقة
    44,   // المعارج
    28,   // نوح
    28,   // الجن
    20,   // المزمل
    56,   // المدثر
    40,   // القيامة
    31,   // الإنسان
    50,   // المرسلات
    40,   // النبأ
    46,   // النازعات
    42,   // عبس
    29,   // التكوير
    19,   // الانفطار
    36,   // المطففين
    25,   // الانشقاق
    22,   // البروج
    17,   // الطارق
    19,   // الأعلى
    26,   // الغاشية
    30,   // الفجر
    20,   // البلد
    15,   // الشمس
    21,   // الليل
    11,   // الضحى
    8,    // الشرح
    8,    // التين
    19,   // العلق
    5,    // القدر
    8,    // البينة
    8,    // الزلزلة
    11,   // العاديات
    11,   // القارعة
    8,    // التكاثر
    3,    // العصر
    9,    // الهمزة
    5,    // الفيل
    4,    // قريش
    7,    // الماعون
    3,    // الكوثر
    6,    // الكافرون
    3,    // النصر
    5,    // المسد
    4,    // الإخلاص
    5,    // الفلق
    6,    // الناس
  ];




}